Repository: cboxdoerfer/fsearch
Catalog: po/*.po
Languages: fr, nb_no

source: <b>Show highlighted search terms:</b> If enabled, the search terms will be highlighted in the results view. For example when you search for "foo" all appearances of <i>foo</i> in file/folder names will be highlighted with bold characters: <b>foo</b>bar.txt file.<b>foo</b> This also works for regular expressions and wildcard expressions starting or ending with an asterisk.
fr: <b>Mettre en évidence les termes de recherche :</b> Si cette option est activée, les termes de recherche seront mis en évidence. Par exemple, lorsque vous recherchez « foo », toutes les occurrences de <i>foo</i> dans les noms de fichiers et de dossiers seront mis en gras : <b>foo</b> bar.txt fichier. <b>foo</b> Cela fonctionne également pour les expressions régulières et les expressions génériques commençant ou finissant par un astérisque.
nb_no: <b>Fremhev søkeord:</b> Hvis skrudd på, fremheves søkeord i resultatlisten. For eksempel, hvis du søker «foo», fremheves alle forekomster av <i>foo</i> i fil/mappenavn med fet tekst: <b>foo</b>bar.txt file.<b>foo</b> Dette fungerer også med regulæruttrykk og jokertegn som starter eller slutter med en asterisk.

source: <b>Show tooltips:</b> If enabled, the results view will show the full path of the focused file/folder in a small tooltip window.
fr: <b>Afficher les infobulles :</b> Si cette option est activée, les résultats afficheront le chemin d’accès complet du fichier/dossier sélectionné dans une infobulle.
nb_no: <b>Vis verktøytips:</b> Hvis skrudd på, vises resultatskjermen den fulle stien til den valgte filen/mappen i et verktøytipsvindu.

source: <b>Show icons in name column:</b> If enabled, file/folder icons will be shown in the name column.
fr: <b>Afficher les icônes dans la colonne de nom :</b> Si cette option est activée, les icônes de fichier/dossier seront affichées dans la colonne de nom.
nb_no: <b>Vis ikoner i navnekolonnen:</b> Hvis skrudd på, vises fil/mappeikoner i navnekolonnen.

source: <b>Remember column configuration:</b> If enabled, the column configuration of the results view from the previous session will be restored when you open an FSearch window. This includes the size and visibility of all columns.
fr: <b>Se souvenir de la configuration des colonnes :</b> Si cette option est activée, la configuration des colonnes de la page des résultats de la session précédente sera restaurée lorsque vous ouvrez une nouvelle fenêtre FSearch. Cela inclut la taille et la visibilité de toutes les colonnes.
nb_no: <b>Husk kolonnekonfigurasjon:</b> Hvis skrudd på, gjenopprettes kolonnekonfigurasjonen fra forrige gang du åpnet FSearch. Dette inkluderer størrelsen og synligheten til alle kolonnene.

source: <b>Remember sort order:</b> If enabled, the sort order of the results view from the previous session will be restored when you open an FSearch window.
fr: <b>Se souvenir de l'ordre de tri :</b> Si cette option est activée, l'ordre de tri de la page des résultats de la session précédente sera restauré lorsque vous ouvrez une nouvelle fenêtre FSearch.
nb_no: <b>Husk sorteringsrekkefølge</b> Hvis skrudd på, huskes sorteringsrekkefølgen på resultatsiden fra forrige gang du åpnet FSearch.

source: <b>Open path with double click in path column:</b> If enabled, double clicking in the path column will open the selected path.
fr: <b>Ouvrir le chemin d’accès avec un double clic :</b> Si cette option est activée, un double-clic dans la colonne du chemin d’accès ouvrira celui-ci.
nb_no: <b>Åpne stier med dobbeltklikk å stikolonnen:</b> Hvis skrudd på, åpnes den valgte stien når du dobbeltklikker på den i stikolonnen.

source: <b>Single click to open:</b> If enabled, a single click will open the selected file/folder. If you only want to select a file/folder while this setting is active, you need to hold <i>Ctrl</i> at the same time while clicking the file/folder.
fr: <b>Un seul clic pour ouvrir :</b> Si cette option est activée, un simple clic ouvrira le fichier/dossier sélectionné. Si vous souhaitez uniquement sélectionner un fichier/dossier pendant que ce paramètre est actif, maintenez <i>Ctrl</i> en même temps tout en cliquant sur le fichier/dossier.
nb_no: <b>Enkeltklikk for å åpne:</b> Hvis skrudd på, vil enkeltklikk åpne den valgte filen/mappen. Hvis du bare vil velge en fil/mappe med denne innstillingen aktivert, må du holde inne <i>Ctrl</i> mens du trykker på filen/mappen.

source: <b>Show database indexing status:</b> If enabled, the path that is currently being indexed is displayed in the statusbar.
fr: <b>Afficher l'état de l'indexation de la base de données :</b> Si cette option est activée, le chemin d'accès en cours d'indexation est affiché dans la barre d'état.
nb_no: <b>Vis status til databaseindeksering</b> Hvis skrudd på, vises stien som indekseres i øyeblikket i statusbaren.

source: <b>Show warning dialogs:</b> If enabled, a warning dialog is displayed when a file or folder failed to open.
fr: <b>Afficher les boîtes de dialogue d'avertissement :</b> Si cette option est activée, une boîte de dialogue d'avertissement s'affichera lorsqu'un fichier ou un dossier n'a pas pu s'ouvrir.
nb_no: <b>Vis adversler:</b> Hvis skrudd på, vises en advarsel når en fil eller en mappe ikke kunne åpnes.

source: <b>Search in path when query contains path separators:</b> If enabled, search terms containing path separators (i.e. "/") will be automatically matched against the full path of a file or folder.
fr: <b>Rechercher dans le chemin lorsque la requête contient des séparateurs de chemin :</b> Si cette option est activée, les termes de recherche contenant des séparateurs de chemin d'accès (c'est-à-dire "/") seront automatiquement comparés au chemin d'accès complet d'un fichier ou d'un dossier.
nb_no: <b>Søk i sti når spørringen inneholder stiinndelere:</b> Hvis skrudd på, vil søkeord som inneholder stiinndelere (for eksempel «/») automatisk matches opp mot den fullstendige stien til en fil eller mappe.

source: <b>Match case when query contains at least one upper case character:</b> If enabled, search terms containing at least one upper case character will trigger a case-sensitive search. This means a search term like <i>Foo</i> will match <i>FooBar.txt</i> but not <i>foobar.txt</i>.
fr: <b>Faire correspondre la casse lorsque la requête contient au moins un caractère majuscule :</b> Si cette option est activée, les termes de recherche contenant au moins un caractère majuscule déclencheront une recherche sensible à la casse. Cela signifie qu'un terme de recherche comme <i>Toto</i> correspondra à <i>TotoBar.txt</i> mais pas à <i>totobar.txt</i>.
nb_no: <b>Skill mellom store eller små bokstaver når spørringen inneholder minst en stor bokstav:</b> Hvis skrudd på, vil søk med minst en stor bokstav i seg skille mellom store og små bokstaver. Dette betyr at søk som <i>Foo</i> vil finne <i>FooBar.txt</i> men ikke <i>foobar.txt</i>.

source: <b>Hide results when search is empty:</b> If enabled, no search results are displayed when the search entry is empty. If disabled, all files and folders will be displayed when the search entry is empty.
fr: <b>Masquer les résultats lorsque la recherche est vide :</b> Si cette option est activée, aucun résultat de recherche n'est affiché lorsque la zone de recherche est vide. Si cette option est désactivée, tous les fichiers et dossiers sont affichés lorsque la zone de recherche est vide.
nb_no: <b>Skjul resultater når søket er tomt:</b> Hvis skrudd på, vises ingen søkeresultater når søkefeltet er tomt. Hvis skrudd av, vises alle filer og mapper når søkefeltet er tomt.

source: <b>Search as you type:</b> If enabled, the search is automatically updated with every keystroke. If disabled, the search is only updated when you hit <i>Enter</i> or press the search button.
fr: <b>Afficher les résultats en temps réel :</b> Si cette option est activée, la recherche est automatiquement mise à jour à chaque frappe. Si cette option est désactivée, la recherche n'est mise à jour que lorsque vous appuyez sur <i>Entrée</i> ou sur l'icône de recherche.
nb_no: <b>Søk mens du skriver:</b> Hvis skrudd på, søkes det automatisk for hvert tegn du putter inn i søkefeltet. Hvis skrudd av, utføres søk bare etter du trykker <i>Enter</i> eller trykker på søkeknappen.

source: <b>Update database on start:</b> If enabled, the database will be updated automatically in the background when you start FSearch.
fr: <b>Mettre à jour la base de données au démarrage :</b> Si cette option est activée, la base de données sera mise à jour automatiquement en arrière-plan lorsque vous démarrez FSearch.
nb_no: <b>Oppdater database ved oppstart:</b> Hvis skrudd på, oppdateres databasen automatisk i bakgrunnen når du starter FSearch.

source: <b>Included folders:</b> This list contains all folders you want to include in the database. • <b>Active:</b> If enabled, the path will included in the database to be searched in. • <b>Path:</b> The full path to be included. • <b>One Filesystem:</b> If enabled, FSearch won't cross filesystem boundaries for this folder
fr: <b>Dossiers inclus :</b> Cette liste contient tous les dossiers que vous souhaitez inclure dans la base de données. • <b>Actif :</b> Si activé, le chemin d'accès sera inclus dans la base de donnée pour être recherché. • <b>Chemin d'accès :</b> Le chemin d'accès complet à inclure. • <b>Système de fichiers unique :</b> Si activé, FSearch ne franchira pas les limites du système de fichiers pour ce dossier (recherchera uniquement dans la partition spécifiée)
nb_no: <b>Inkluderte mapper:</b> Denne listen inneholder alle mapper du vil skal være inkludert i databasen. • <b>Aktiv:</b> Hvis skrudd på, vil stien inkluderes i databasen for søk. • <b>Sti:</b> Den fullstendige stien som skal inkluderes. • <b>Ett filsystem Filesystem:</b> Hvis skrudd på, vil ikke FSearch søke på tvers av andre filsystemer for denne mappen

source: <b>Add folder to database:</b> This button opens a dialog where you can select a folder you want to include in the database for searching.
fr: <b>Ajouter le dossier dans la base de données :</b> Ce bouton ouvre une boîte de dialogue dans laquelle vous pouvez inclure un dossier dans la base de données pour être recherché.
nb_no: <b>Legg til mappe i database:</b> Denne knappen åpner et vindu hvor du kan velge en mappe å legge til i databasen for søk.

source: <b>Remove selected row:</b> This removes the selected folder from the list of included folders.
fr: <b>Supprimer la ligne sélectionnée :</b> Ceci retire le dossier sélectionné de la liste des dossiers inclus.
nb_no: <b>Fjern valgt rad:</b> Dette fjerner den valgte mappen fra listen over inkluderte mapper.

source: <b>Excluded folders:</b> This list contains all folders you want to exclude from the database. • <b>Active:</b> If enabled, the path will excluded from the database and can't be searched in. • <b>Path:</b> The full path to be excluded.
fr: <b>Dossiers exclus :</b> Cette liste contient tous les dossiers que vous souhaitez exclure de la base de données. • <b>Actif :</b> Si activé, le chemin sera exclu de la base de donnée et ne pourra être recherché. • <b>Chemin d'accès :</b> Le chemin d'accès complet à exclure.
nb_no: <b>Ekskluderte mapper:</b> Denne listen inneholder alle mapper du vil skal ekskluderes fra databasen. • <b>Aktiv:</b> Hvis skrudd på, vil stien ekskluderes fra databasen og kan dermed ikke søkes i. • <b>Sti:</b> Den fullstendige stien som skal ekskluderes.

source: <b>Exclude folder from database:</b> This button opens a dialog where you can select a folder you want to exclude from the database.
fr: <b>Exclure le dossier de la base de données :</b> Ce bouton ouvre une boîte de dialogue dans laquelle vous pouvez sélectionner un dossier que vous souhaitez exclure de la base de données.
nb_no: <b>Ekskluder mappe fra database:</b> Denne knappen åpner et vindu hvor du kan velge en mappe du vil ekskludere fra databasen.

source: <b>Remove selected row:</b> This removes the selected folder from the list of excluded folders.
fr: <b>Supprimer la ligne sélectionnée :</b> Ceci retire le dossier sélectionné de la liste des dossiers exclus.
nb_no: <b>Fjern valgt rad:</b> Dette fjerner den valgte raden fra listen over ekskluderte mapper.

source: <b>Exclude files and folders from database:</b> This is a semi-colon separated list of files (or folders) you want to exclude from the database. For example <i>.git;.cache;*.swp</i> will exclude all files or folders which are called either <i>.git</i> or <i>.cache</i> or end with <i>.swp</i>.
fr: <b>Exclure des fichiers et des dossiers de la base de données :</b> Il s'agit d'une liste de fichiers (ou de dossiers) séparés par des points-virgules que vous souhaitez exclure de la base de données. Par exemple, <i>.git;.cache;*.swp</i> exclura tous les fichiers ou dossiers appelés <i>.git</i> ou <i>.cache</i> ou se terminant par <i>.swp</i>.
nb_no: <b>Ekskluder filer og mapper fra databasen:</b> Dette er en liste over filer og mapper du vil skal eksluderes fra databasen. Bruk semikolon som skilletegn mellom elementer. For eksempel <i>.git;.cache;*.swp</i> vil ekskludere alle filer eller mapper som heter enten <i>.git</i> or <i>.cache</i> eller som slutter med <i>.swp</i>.

source: <b>Exclude hidden files and folders:</b> If enabled, hidden files and folders will be excluded from the database <i>(i.e. all files or folders which start with a dot character)</i>.
fr: <b>Exclure les fichiers et dossiers cachés :</b> Si cette option est activée, les fichiers et dossiers cachés seront exclus de la base de données <i>(c'est-à-dire tous les fichiers ou dossiers commençant par un point)</i>.
nb_no: <b>Ekskluder skjulte filer og mapper:</b> Hvis skrudd på, ekskluderes skjulte filer og mapper fra databasen<i>(altså alle filer og mapper som starter med punktum)</i>.

source: Focus a setting to get a detailed description of what it does.
fr: Placez le curseur sur un paramètre pour afficher l'aide.
nb_no: Velg en innstilling for å få en beskrivelse over hva det gjør.

source: <b>Periodically update database at a specific time interval:</b> If enabled and as long as FSearch is running, the database will be updated periodically with the given time interval. If you want to update the database in the background, even when FSearch is not running, you should use tools like cron or systemd timers to periodically trigger the update with: <i><tt>fsearch --update-database</tt></i>
fr: <b>Mettre à jour périodiquement la base de données à un intervalle de temps spécifique :</b> Si cette option est activée, tant que FSearch est en cours d'exécution, la base de données sera mise à jour périodiquement avec l'intervalle de temps donné. Si vous souhaitez mettre à jour la base de données en arrière-plan lorsque FSearch n'est pas en cours d'exécution, vous devez utiliser des outils comme les minuteries Cron ou Systemd pour déclencher périodiquement la mise à jour : <i> <tt> fsearch --update-database </tt> </i>
nb_no: <b>Oppdater databasen ved satte tidsintervall:</b> Hvis skrudd på, så lenge FSearch kjører, vil databasen oppdateres så ofte som det gitte tidsintervallet. Hvis du vil oppdatere databasen i bakgrunnen, selv når FSearch ikke kjører, burde du bruke verktøy som cron eller systemd-timere for å periodisk utløse en databaseoppdatering med: <i><tt>fsearch --update-database</tt></i>

source: <b>Launch desktop files:</b> If enabled, activating a <i>.desktop</i> file will launch the application defined within that file. This way FSearch can act like an application launcher. Otherwise the <i>.desktop</i> file will be opened with the default handler for this type of files, which is usually a text editor.
fr: <b>Exécuter les fichiers .desktop :</b> Si cette option est activée, l'exécution d'un fichier <i>.desktop</i> lancera l'application correspondante. Ainsi, FSearch se comporte comme un lanceur d'applications. Sinon, le fichier <i>.desktop</i> sera ouvert avec the l'application par défaut pour ce type d'extension de fichier, habituellement un éditeur de texte.
nb_no: <b>Start .desktop-filer:</b> Hvis skrudd på, vil å aktivere en <i>.desktop</i>-fil starte applikasjonen definert i den filen. Slik kan FSearch fungere som en applikasjonsstarter. Ellers vil <i>.desktop</i>-filen bli åpnet med standardprogrammet for denne typen filer, som vanligvis er et tekstredigeringsprogram.

source: <b>Filters:</b> This is a list of all available filters. A filter is a predefined search. • <b>Name:</b> A unique and descriptive identifier for the filter • <b>Macro:</b> By typing the macro text followed by a ':' you can enable the filter on demand • <b>Query:</b> The search term by which the database should be filtered
fr: <b>Filtres :</b> Il s'agit d'une liste de tous les filtres disponibles. Un filtre est une recherche prédéfinie. • <b>Nom :</b> Un identifiant unique qui décrit le filtre • <b>Macro :</b> En saisissant le texte de la macro suivi d'un « : » ; vous pouvez activer le filtre sur demande • <b>Requête :</b> Le terme de recherche par lequel la base de données doit être filtrée
nb_no: <b>Filtre:</b> Dette er en liste over alle tilgjengelige filtre. Et filter er et forhåndsdefinert søk. • <b>Navn:</b> Et unikt navn til filteret • <b>Makro:</b> Ved å skrive inn makrotekst fulgt av et «:», kan du skru på filteret når du ønsker • <b>Spørring:</b> Søkeordet du vil at databasen skal filtreres etter

source: <b>Add a new filter:</b> This button opens a dialog where you can edit a new filter.
fr: <b>Ajouter un nouveau filtre :</b> Ce bouton ouvre une boîte de dialogue dans laquelle vous pouvez éditer un nouveau filtre.
nb_no: <b>Legg til et nytt filter:</b> Denne knappen åpner et vindu hvor du kan redigere et nytt filter.

source: <b>Remove selected filter:</b> This button removes the currently selected filter.
fr: <b>Supprimer le filtre sélectionné :</b> Ce bouton supprime le filtre sélectionné.
nb_no: <b>Fjern valgt filter:</b> Denne knappen fjerner det valgte filteret.

source: <b>Edit selected filter:</b> This button opens a dialog where you can edit the selected filter.
fr: <b>Modifier le filtre sélectionné :</b> Ce bouton ouvre une boîte de dialogue dans laquelle vous pouvez modifier le filtre sélectionné.
nb_no: <b>Rediger valgt filter:</b> Denne knappen åpner et vindu hvor du kan redigere det valgte filteret.

source: <b>Restore default filters:</b> This button restores the default filter configuration. ⚠ All filters which were created or edited by the user will be lost! ⚠
fr: <b>Restaurer les filtres par défaut :</b> Ce bouton restaure la configuration des filtres par défaut. ⚠ Tous les filtres créés ou modifiés par l'utilisateur seront perdus ! ⚠
nb_no: <b>Gjenopprett standardfiltre:</b> Denne knappen gjenoppretter standardfilterkonfigurasjonen. ⚠ Alle brukergenererte filtre og endringer til forhåndsdefinerte filtre vil bli slettet! ⚠

source: <b>Exit on Escape:</b> If enabled, FSearch exits when the Escape key is pressed instead of the window being minimized.
fr: <b>Quitter sur Échap :</b> Si cette option est activée, FSearch se ferme lorsque la touche Échap est enfoncée au lieu de réduire la fenêtre.
nb_no: <b>Avslutt ved Esc:</b> Hvis skrudd på, avsluttes FSearch når Esc-knappen trykkes, fremfor at vinduet minimeres.

source: Help
fr: Aide
nb_no: _Hjelp

source: Select folder
fr: Sélectionnez un dossier
nb_no: Velg mappe

source: _Select
fr: _Sélectionner
nb_no: _Velg

source: Add filter
fr: Ajouter un filtre
nb_no: Legg til filter

source: Active
fr: Actif
nb_no: Aktiv

source: Path
fr: Chemin d'accès
nb_no: Sti

source: One Filesystem
fr: Système de fichiers unique
nb_no: Ett filsystem

source: Name
fr: Nom
nb_no: Navn

source: Macro
nb_no: Makro

source: Query
fr: Requête
nb_no: Spørring

source: %'d Item
fr: %'d élément
nb_no: %'d element

source: %'d Items
fr: %'d éléments
nb_no: %'d elementer

source: Querying…
fr: Requête en cours…
nb_no: Utfører spørring…

source: Loading…
fr: Chargement…
nb_no: Laster…

source: Scanning…
fr: Balayage…
nb_no: Skanner…

source: Number of Search Results
fr: Nombre de résultats de recherche
nb_no: Antall søkeresultater

source: 0 Items
fr: 0 élément
nb_no: 0 elementer

source: Cancel
fr: Annuler
nb_no: Avbryt

source: Index:
nb_no: Indeks:

source: Number of selected folders
fr: Nombre de dossiers sélectionnés
nb_no: Antall valgte mapper

source: Number of selected files
fr: Nombre de fichiers sélectionnés
nb_no: Antall valgte filer

source: Cancel database update
fr: Annuler la mise à jour de la base de données
nb_no: Avbryt databaseoppdatering

source: Number of database items
fr: Nombre d'éléments dans la base de données
nb_no: Antall databaseelementer

source: (empty)
fr: (vide)
nb_no: (tom)

source: Search term contains upper case characters. <b>Match Case</b> was temporarily activated for this term.
fr: Le terme de recherche des caractères majuscules. <b>Correspondre à la casse</b> a été temporairement activé pour ce terme.
nb_no: Søket inneholder store bokstaver. <b>Skill mellom store og små bokstaver</b> ble midlertidig påslått for dette søket.

source: CASE
fr: CASSE
nb_no: STORE/SMÅ

source: Search term contains path separators. <b>Search in Path</b> was temporarily activated for this term.
fr: Le terme de recherche contient un séparateur de chemin d'accès. <b>Rechercher dans le chemin d'accès</b> a été temporairement activé pour ce terme.
nb_no: Søket inneholder stiinndelere. <b>Søk i sti</b> ble midlertidig påslått for dette søket.

source: PATH
fr: CHEMIN
nb_no: STI

source: REGEX
nb_no: Regulært uttrykk

source: Size
fr: Taille
nb_no: Størrelse

source: Extension
nb_no: Utvidelse

source: Date Modified
fr: Date de modification
nb_no: Dato endret

source: Sorting by <b>Type</b> can take a few seconds with many results. This sort order is not persistent, it will be reset when the search term changes.
fr: Le tri par <b>Type</b> peut prendre quelques secondes avec de nombreux résultats. Cet ordre de tri n'est pas permanent, il sera réinitialisé lorsque le terme de recherche changera.
nb_no: Sortering etter <b>Type</b> kan ta noen sekunder hvis det er mange resultater. Sorteringsrekkefølgen er ikke vedvarende, og blir nullstilt når spørringen endres.

source: New window
fr: Nouvelle fenêtre
nb_no: Nytt vindu

source: Update database
fr: Mettre à jour la base de données
nb_no: Oppdater database

source: Search in Path
fr: Rechercher dans le chemin d'accès
nb_no: Søk i sti

source: Match Case
fr: Respecter la casse
nb_no: Skill mellom store og små bokstaver

source: Enable RegEx
fr: Activer les expressions régulières
nb_no: Skru på regulæruttrykk

source: Show Statusbar
fr: Afficher la barre d'état
nb_no: Vis statusfelt

source: Show Filter
fr: Afficher le filtre
nb_no: Vis filter

source: Show Search Button
fr: Afficher le bouton de recherche
nb_no: Vis søkeknapp

source: About
fr: À propos
nb_no: Om

source: Quit
fr: Quitter
nb_no: Avslutt

source: Donate
fr: Faire un don
nb_no: Doner

source: Bug Reports and Feature Requests
fr: Rapports de bogues et requêtes pour de nouvelles fonctionnalités
nb_no: Feilrapporter og funksjonsforespørsler

source: GitHub Sponsors
nb_no: GitHub-sponsorer

source: Search…
fr: Rechercher…
nb_no: Søk…

source: Select a Filter
fr: Sélectionner un filtre
nb_no: Velg et filter

source: Do you really want to open %d file(s)?
fr: Voulez-vous vraiment ourvrir %d fichier(s) ?
nb_no: Ønsker du virkelig å åpne %d fil(er)?

source: Opening Files…
fr: Ouverture des fichiers…
nb_no: Åpner filer…

source: Do you really want to remove %d file(s)?
fr: Voulez-vous vraiment supprimer %d fichier(s) ?
nb_no: Ønsker du virkelig å fjerne %d fil(er)?

source: Deleting files…
fr: Suppression des fichiers…
nb_no: Sletter filer…

source: Moving files to trash…
fr: Déplacement des fichiers dans la corbeille…
nb_no: Flytter filer til papirkurv…

source: Something went wrong.
fr: Quelque chose s’est mal passé.
nb_no: Noe gikk galt.
