Repository: cboxdoerfer/fsearch
Catalog: po/*.po
Languages: fr, nb_no

source: A file search application focusing on performance and advanced features
fr: Un utilitaire de recherche axé sur la performance et avec des fonctionnalités avancées
nb_no: Et filsøkeverktøy med fokus på ytelse og avanserte funksjoner

source: search;fsearch;files;folders;music;video;documents;find;tool;everything;
fr: rechercher;fsearch;fichiers;dossiers;musique;vidéos;documents;trouver;outil;tout;
nb_no: søk;fsearch;filer;mapper;musikk;video;dokumenter;finn;verktøy;alt;

source: File Search Utility
fr: Utilitaire de recherche de fichiers
nb_no: Filsøkningsverktøy

source: A graphical file search application
fr: Une interface graphique pour la recherche de fichiers
nb_no: En grafisk filsøkningsapplikasjon

source: FSearch helps you to find files and folders as easy and fast as possible. Just type a few letters and search results will appear almost instantly.
fr: Fsearch vous aide à trouver des fichiers et des dossiers aussi facilement et rapidement que possible. Tapez quelques lettres et les résultats de recherche s'afficheront presque instantanément.
nb_no: FSearch hjelper deg med å finne filer og mapper så lett og så raskt som mulig. Bare skriv inn noen få bokstaver, så dukker resultater opp nesten umiddelbart.

source: Ignore case (e.g. searching for "<code>fsearch</code>" will match "FSearch" as well)
fr: Ignorer la casse (par exemple, la recherche de "<code>fsearch</code>" correspondra également à " FSearch ")
nb_no: Ignorer store og små bokstaver (f.eks. at søk på «<code>fsearch</code>» også viser «FSearch»)

source: Regular expressions
fr: Expressions régulières
nb_no: Regulæruttrykk

source: Wildcard support
fr: Prise en charge des caractères génériques
nb_no: Støtte for jokertegn

source: Filter support (e.g. only search for audio files)
fr: Prise en charge des filtres (p. ex., recherchez uniquement des fichiers audio)
nb_no: Filterstøtte (f.eks. søk kun etter lydfiler)

source: Exclude certain files and folders
fr: Exclure certains fichiers et dossiers
nb_no: Utelat visse filer og mapper

source: Fast sort by name, path, size, modification time and extension
fr: Triez rapidement par nom, chemin d'accès, taille, heure de modification et extension de fichier
nb_no: Rask sortering etter navn, si, størrelse, sist endret og filendelse

source: <em>Note:</em> Due to Flatpak's sandboxing, FSearch can't find every file on your system.
fr: <em>Remarque :</em> En raison du conteneur Flatpak, FSearch ne peut pas trouver tous les fichiers de votre système.
nb_no: <em>Merk:</em> På grunn av Flatpaks sandkasse, kan ikke FSearch søke gjennom alle filene på systemet ditt.

source: The default UI layout
fr: Disposition de l’interface utilisateur par défaut
nb_no: Standard brukergrensesnitt

source: A layout more closely following GNOME HIGs
fr: Une interface s'inspirant de l'ergonomie IHM de GNOME
nb_no: Et opplegg som nærmere følger GNOME HIG

source: search
fr: rechercher
nb_no: søk

source: files
fr: fichiers
nb_no: filer

source: folders
fr: dossiers
nb_no: mapper

source: music
fr: musique
nb_no: musikk

source: documents
nb_no: dokumenter

source: find
fr: trouver
nb_no: finn

source: tool
fr: outil
nb_no: verktøy

source: everything
fr: tout
nb_no: alt

source: New search engine
fr: Nouveau moteur de recherche
nb_no: Ny søkemotor

source: Greatly improved highlighting of search terms
fr: Amélioration considérable de la mise en évidence des termes de recherche
nb_no: Betydelig forbedret fremheving av søkeord

source: Custom filters
fr: Filtres personnalisés
nb_no: Egendefinerte filtre

source: Improved sort performance
fr: Amélioration des performances de tri
nb_no: Forbedret sorteringsytelse

source: Improved scroll performance
fr: Amélioration des performances de défilement
nb_no: Forbedret rullingsytelse

source: Remember file selection after a database update
fr: Mémoriser la sélection de fichiers après une mise à jour de la base de données
nb_no: Husk filvalget etter databaseoppdatering

source: Automatically scroll the result list in rubberband selection mode
fr: Défilement automatique de la liste des résultats en mode de sélection élastique
nb_no: Automatisk rull ned resultatlisten i gummibånd-valgmodus

source: Invert selection with rubber band when 'Ctrl' is pressed
fr: Inverser la sélection avec la molette lorsque la touche 'Ctrl' est enfoncée
nb_no: Snu om valget med gummibåndet når «Ctrl» trykkes

source: Focus search entry when the main window gets activated
fr: Focus sur l’entrée de recherche lorsque la fenêtre principale est activée
nb_no: Flytt fokus til søkefeltet når hovedvinduet blir aktivert

source: Add filter for applications (i.e. .desktop files)
fr: Ajouter un filtre pour les applications (i.e. .desktop)
nb_no: Legg til filter for applikasjoner (for eksempel .desktop-filer)

source: Add option to launch applications directly instead of opening the .desktop files
fr: Ajout d'une option permettant de lancer directement les applications au lieu d'ouvrir les fichiers .desktop
nb_no: Legg til et valg som starter applikasjoner direkte istedenfor å åpne .desktop-filene

source: Show application icons for .desktop files
fr: Afficher les icônes des applications pour les fichiers .desktop
nb_no: Vis applikasjonsikoner for .desktop-filer

source: Add .odp and .ods files to document filter
fr: Ajout des fichiers .odp et .ods au filtre de documents
nb_no: Legg til .odp- og .ods-filer til dokumentfilter

source: 'Open with' menu now only shows applications which can handle the selected files
fr: Le menu "Ouvrir avec" n'affiche plus que les applications capables de traiter les fichiers sélectionnés
nb_no: «Åpne med»-menyen viser nå bare applikasjoner som kan åpne de valgte filene

source: Improved opening of multiple files with the same type (they get now passed as a list to applications, instead of one by one)
fr: Amélioration de l'ouverture de plusieurs fichiers du même type (ils sont désormais transmis sous forme de liste aux applications, au lieu d'être transmis un par un)
nb_no: Forbedret åpning av flere filer med samme type (de blir nå sendt som en liste til applikasjoner, fremfor en og en)

source: Better support for opening files in sandboxed mode
fr: Meilleure prise en charge de l’ouverture de fichiers en mode bac à sable (sandbox)
nb_no: Bedre støtte for å åpne filer fra sandkasse-modus

source: Add menu items with links to the issue tracker, forum and donation pages
fr: Ajout dans le menu de liens vers les pages de suivi des problèmes, de forum et de dons
nb_no: Legg til menyvalg med lenker til feilsporeren, forumet og donasjonssidene

source: Improve support for non-Linux systems
fr: Améliore la prise en charge des systèmes autre que Linux
nb_no: Forbedret støtte for systemer utenom Linux

source: Add option to exit FSearch when Escape is pressed instead of minimizing the window
fr: Ajout d'une option permettant de quitter FSearch en appuyant sur Echap au lieu de minimiser la fenêtre
nb_no: Legg til valg om å avslutte FSearch når Esc trykkes fremfor å minimere vinduet

source: Exclude '/proc' and '/sys' by default
fr: Exclure '/proc' et '/sys' par défaut
nb_no: Ekskluder «/proc» og «/sys» som standard

source: Open context menu when 'Menu' key or 'Shift + F10' are pressed
fr: Ouvrir le menu contextuel lorsque la touche "Menu" ou "Maj + F10" est enfoncée
nb_no: Åpne kontekstmenyen når «Menu» eller «Shift + F10» trykkes

source: and tons of bug fixes, translation updates and smaller improvements
fr: et des tonnes de corrections de bogues, de mises à jour de traduction et de petites améliorations
nb_no: og mange feilfikser, oversettelsesoppdateringer og andre små forbedringer

source: Initial release.
fr: Version initiale.
nb_no: Første utgivelse.

source: Saving…
fr: Enregistrement…
nb_no: Lagrer…

source: translator-credits
fr: Traducteurs : Pierre-Louis K., Roxfr, Mathieu B., mbousq,
nb_no: Allan Nordhøy

source: A search utility focusing on performance and advanced features
fr: Un utilitaire de recherche axé sur la performance et les fonctionnalités avancées
nb_no: Et søkeverktøy med fokus på ytelse og avanserte funksjoner

source: Open a new application window
fr: Ouvrir une nouvelle fenêtre d'application
nb_no: Åpne i et nytt vindu

source: Show the application preferences
fr: Afficher les préférences de l'application
nb_no: Vis applikasjonsinnstillingene

source: Set the search pattern
fr: Définir le modèle de recherche
nb_no: Sett søkemønsteret

source: Update the database and exit
fr: Mettre à jour la base de données et quitter
nb_no: Oppdater database og avslutt

source: Print version information and exit
fr: Imprimer les informations sur la version et quitter
nb_no: Skriv ut versjoninfo og avslutt

source: Loading folders…
fr: Chargement des dossiers…
nb_no: Laster mapper…

source: Loading files…
fr: Chargement des fichiers…
nb_no: Laster filer…

source: Sorting…
fr: Tri des résultats…
nb_no: Sorterer…

# Will be followed by the path of the file.
source: Error when removing file
fr: Erreur lors de la suppression du fichier
nb_no: En feil oppsto under fjerning av fil

source: Failed to get path
fr: Échec de l’obtention du chemin
nb_no: Klarte ikke å finne sti

# Will be followed by the file path.
source: Error when getting information from file
fr: Erreur lors de l'obtention d'informations à partir du fichier
nb_no: En feil oppsto under innhenting av informasjon fra fil

source: Failed to get application information
fr: Échec de l’obtention des informations de l’application
nb_no: Kunne ikke få applikasjonsinformasjon

# Will be followed by the content type string.
source: Error when getting information for content type
fr: Erreur lors de l’obtention des informations pour le type de contenu
nb_no: En feil oppsto ved innhenting av informasjon om innholdstype

source: No default application registered
fr: Aucune application par défaut enregistrée
nb_no: Ingen standardapplikasjon registrert

# Will be followed by the path of the folder.
source: Error when opening parent folder
fr: Erreur lors de l’ouverture du dossier parent
nb_no: En feil oppsto ved åpning av overmappen

source: Failed to get parent path
fr: Échec de l’obtention du chemin parent
nb_no: Kunne ikke hente overordnet sti

# Will be followed by the path of the folder.
source: Error while opening folder
fr: Erreur lors de l’ouverture du dossier
nb_no: En feil oppsto ved åpning avmappe

source: Failed to build open command
fr: Échec de la construction de la commande d’ouverture
nb_no: Kunne ikke bygge åpningskommando

source: Folder
fr: Dossier
nb_no: Mappe

source: Unknown Type
fr: Type inconnu
nb_no: Ukjent type

source: All
fr: Tout
nb_no: Alle

source: Folders
fr: Dossiers
nb_no: Mapper

source: Files
fr: Fichiers
nb_no: Filer

source: Applications
nb_no: Applikasjoner

source: Archives
nb_no: Arkiver

source: Audio
nb_no: Lyd

source: Documents
nb_no: Dokumenter

source: Pictures
fr: Images
nb_no: Bilder

source: Videos
fr: Vidéos
nb_no: Videoer

source: Macro names must not contain `:` characters.
fr: Les noms des macros ne doivent pas contenir le caractère « : ».
nb_no: Makronavn kan ikke inneholde «:»-tegnet.

source: _Cancel
fr: _Annuler
nb_no: _Oppdater

source: Edit filter
fr: Modifier le filtre
nb_no: Rediger filter

source: Name:
fr: Nom :
nb_no: Navn:

source: The unique name of this filter
fr: Le nom unique de ce filtre
nb_no: Det unike navnet til dette filteret

source: Unique filter name
fr: Nom de filtre unique
nb_no: Unikt filternavn

source: Search in path
fr: Rechercher dans le chemin d’accès
nb_no: Søk i sti

source: Enable regular expressions
fr: Activer les expressions régulières
nb_no: Skru på regulæruttrykk

source: Match case
fr: Respecter la casse
nb_no: Skill mellom store og små bokstaver

source: Query:
fr: Requête :
nb_no: Spørring:

source: Macro:
nb_no: Makro:

source: The macro for this filter. A macro allows you to access this filter from the search entry by typing its text followed by ':'
fr: La macro pour ce filtre. Une macro vous permet d'accéder à ce filtre à partir de la barre de recherche en saisissant son texte suivi de « : »
nb_no: Makroen til dette filteret. En makro lar deg få tilgang til dette filteret fra søkefeltet ved å skrive inn teksten dens fulgt av ':'

source: Properties…
fr: Propriétés…
nb_no: Egenskaper…

source: Other Application…
fr: Autre application…
nb_no: Annet program…

source: Empty Database
fr: Base de données vide
nb_no: Tøm database

source: Add folders
fr: Ajouter des dossiers
nb_no: Legg til mapper

source: Loading Database…
fr: Chargement de la base de données…
nb_no: Laster database…

source: This won't take long.
fr: Cela ne sera pas long.
nb_no: Dette tar ikke lang tid.

source: Updating Database…
fr: Mise à jour de la base de données…
nb_no: Oppdaterer database…

source: This may take a while.
fr: Ceci peut prendre un peu de temps.
nb_no: Dette kan ta sin tid.

source: Empty Query
fr: Requête vide
nb_no: Tøm spørring

source: Press <b>Ctrl + F</b> and start typing.
fr: Appuyez sur <b>Ctrl + F</b> et commencez à écrire.
nb_no: Trykk <b>Ctrl + F</b> og begynn å skrive.

source: No Results Found
fr: Aucun résultat trouvé
nb_no: Ingen resultater funnet

source: Try a different search
fr: Essayez une recherche différente
nb_no: Prøv et annet søk

source: Sorting results…
fr: Tri des résultats…
nb_no: Sorterer resultater…

source: Preferences
fr: Préférences
nb_no: Innstillinger

source: Enable dark theme
fr: Activer le thème sombre
nb_no: Bruk mørk drakt

source: Enable client-side decorations (requires restart)
fr: Activer les décorations coté client (requiert le redémarrage)
nb_no: Skru på dekorasjoner på klientsiden (omstart kreves)

source: Use binary units instead of decimal units
fr: Utiliser des unités binaires au lieu des unités décimales
nb_no: Bruk totallsenheter istedenfor titallsenheter

source: Remember window size
fr: Se souvenir de la taille de la fenêtre
nb_no: Husk vindusstørrelse

source: Exit on Escape
fr: Quitter sur Échap
nb_no: Avslutt når du trykker Esc

source: with keyboard shortcuts or menu entries
fr: avec des raccourcis clavier ou des entrées de menu
nb_no: med tastatursnarveier eller menyoppføringer

source: with double click
fr: avec un double clic
nb_no: med dobbeltklikk

source: Behaviour after successfully opening a file:
fr: Comportement à l'ouverture réussie d'un dossier :
nb_no: Adferd etter vellykket åpning av fil:

source: Nothing
fr: Rien
nb_no: Ingenting

source: Minimize
fr: Minimiser
nb_no: Minimer

source: Close
fr: Fermer
nb_no: Lukk

source: General:
fr: Général :
nb_no: Generelt:

source: Show highlighted search terms
fr: Mettre en évidence les termes de recherche
nb_no: Vis framhevede søkeord

source: Show tooltips
fr: Afficher les infobulles
nb_no: Vis verktøystips

source: Show icons in name column
fr: Afficher les icônes dans la colonne de nom
nb_no: Vis ikoner i navnekolonne

source: Remember column configuration
fr: Se souvenir de la configuration des colonnes
nb_no: Husk kolonneoppsett

source: Remember sort order
fr: Se souvenir de l'ordre de tri
nb_no: Husk sorteringsrekkefølge

source: Open path with double click in path column
fr: Ouvrir le chemin d’accès en double-cliquant dans la colonne correspondante
nb_no: Åpne sti ved å dobbeltklikke i sti-kolonnen

source: Single click to open
fr: Simple clique pour ouvrir
nb_no: Trykk én gang for å åpne

source: Launch desktop files
fr: Exécuter les fichiers .desktop
nb_no: Start skrivebordsfiler

source: Results:
fr: Résultats :
nb_no: Resultater:

source: Show database indexing status
fr: Afficher le status d'indexation de la base de données
nb_no: Vis indekseringsstatus til database

source: Statusbar:
fr: Barre d'état :
nb_no: Statusfelt:

source: Show warning dialogs when:
fr: Afficher un avertissement lorsque :
nb_no: Vis advarselsdialoger når:

source: file / folder failed to open
fr: le fichier/dossier n'a pas pu être ouvert
nb_no: klarte ikke å åpne fil/mappe

source: Dialogs:
fr: Dialogues :
nb_no: Dialogvinduer:

source: Interface
nb_no: Grensesnitt

source: Search in path when query contains path separators
fr: Rechercher dans le chemin d’accès quand la requête contient des séparateurs de chemin d’accès
nb_no: Søk i sti når spørring inneholder stiinndelere

source: Search as you type
fr: Rechercher au fur et à mesure de la saisie
nb_no: Søk mens du skriver

source: Hide results when search is empty
fr: Cacher les résultats lorsque la recherche est vide
nb_no: Skjul resultatløse søkeresultater

source: Match case when query contains at least one upper case character
fr: Respecter la casse quand la requête contient des majuscules
nb_no: Match når spørringen inneholder minst en stor bokstav

source: Add new filter
fr: Ajouter un nouveau filtre
nb_no: Legg til nytt filter

source: Remove selected filter
fr: Supprimer le filtre sélectionné
nb_no: Fjern valgte filter

source: Edit selected filter
fr: Modifier le filtre sélectionné
nb_no: Rediger valgt filter

source: Restore default filters
fr: Restaurer les filtres par défaut
nb_no: Gjenopprett standardfiltere

source: Search
fr: Rechercher
nb_no: Søk

source: Update database on start
fr: Mettre à jour la base de données au démarrage
nb_no: Oppdater database ved oppstart

source: Update every
fr: Mettre à jour toutes les
nb_no: Oppdater hver

source: hour(s) and
fr: heure(s) et
nb_no: time(r) og

source: minute(s)
nb_no: minutt(er)

source: Enter path…
fr: Saisissez le chemin…
nb_no: Legg inn sti…

source: Add path to be included in database
fr: Ajouter le chemin d’accès à inclure dans la base de données
nb_no: Legg til sti som skal inkluderes i databasen

source: Remove selected path
fr: Retirer le chemin d’accès sélectionné
nb_no: Fjern valgt sti

source: Include
fr: Inclure
nb_no: Inkluder

source: Add path to be excluded from database
fr: Ajouter le chemin d’accès à exclure de la base de données
nb_no: Legg til sti som skal ekskluderes fra database

source: Supports wildcards. Multiple entries must be separated by ';'
fr: Les jokers sont acceptés. Séparez les entrées avec un point-virgule
nb_no: Støtter jokertegn. Flerfoldige oppføringer må inndeles med ";"

source: Exclude files:
fr: Exclure les fichiers :
nb_no: Ekskluder filer:

source: e.g. ".git;*.tmp"
fr: par ex. « .git;*.tmp »
nb_no: f.eks. ".git;*.tmp"

source: Exclude hidden files and folders
fr: Exclure les fichiers et dossiers cachés
nb_no: Utelat skjulte filer og mapper

source: Exclude
fr: Exclure
nb_no: Utelat

source: <b>Enable dark theme:</b> If enabled, the system theme is asked to use a darker styling for the application <i>(i.e. dark UI elements on bright text)</i>. Note that not all system themes provide such a darker variant, therefore enabling this setting might not have an effect.
fr: <b>Activer le thème sombre :</b> Si cette option est activée, il sera demandé au thème système d'utiliser un style plus sombre pour l'application <i>(ex : éléments de l'interface sombres avec texte clair)</i>. Notez que certains thèmes système ne fournissent pas une variante sombre, dans ce cas cette option n'aura aucun effet.
nb_no: <b>Skru på mørk drakt</b> Hvis skrudd på, bes systemdrakten å bruke mørkere farger til applikasjonen <i>(f.eks. mørke brukergrensesnittelemener ved lys tekst)</i>. Mer at ikke alle systemdrakter har mørkere varianter, så å endre på denne innstillingen kan ha ingen effekt.

source: <b>Enable client-side decorations:</b> If enabled, the search entry and main menu are displayed in the window title bar. If disabled, the main menu is displayed as a menu bar with the search entry below it. This resembles a more traditional UI layout and takes a little bit more space.
fr: <b>Activer les décorations côté client :</b> Si cette option est activée, la barre de recherche et le menu principal s'affichent dans la barre de titre de la fenêtre. Si cette option est désactivée, le menu principal s'affiche sous la forme d'une barre de menus avec la barre de recherche en dessous. Cette disposition est plus traditionnelle et prend un peu plus d'espace.
nb_no: <b>Skru på klientside-dekorasjoner:</b> Hvis skrudd på, vises søkefeltet og hovedmenyen i vindutittelbaren. Hvis skrudd av, vises hovedmenyen som en menybar med søkefeltet under seg. Dette etterligner et mer tradisjonelt brukergrensesnitt og tar litt mer plass.

source: <b>Use binary units instead of decimal units:</b> This settings controls how file sizes are displayed. • <b>Binary units:</b> This refers to binary IEC prefixes <i>(e.g. 1 KiB = 1024 bytes)</i> • <b>Decimal units:</b> This refers to decimal SI prefixes <i>(e.g. 1 kB = 1000 bytes)</i>
fr: <b>Utiliser des unités binaires au lieu des unités décimales :</b> Ce paramètre contrôle la manière dont les tailles de fichier sont affichées. • <b>Unités binaires :</b> Ceci fait référence aux préfixes binaires IEC <i>(par exemple 1 Kio = 1024 octets)</i> • <b>Unités décimales :</b> Cela fait référence aux préfixes décimaux SI <i>(par exemple 1 ko = 1000 octets)</i>
nb_no: <b>Bruk totallsystemenheter istedenfor titallsystemenheter:</b> Denne innstillingen endrer hvordan filstørrelser vises settings controls how file sizes are displayed. • <b>Totallsystemenheter</b> Dette er likt IEC-prefiksene <i>(1 KiB = 1024 byte)</i> • <b>Titallsystemenheter :</b> Dette er likt de desimale SI-prefiksene <i>(1 kB = 1000 byte)</i>

source: <b>Remember window size:</b> If enabled, the window size from the previous session will be restored when you open an FSearch window. Note that some window managers ignore this request and force the window to have a different size.
fr: <b>Se rappeler de la taille de la fenêtre :</b> Si cette option est activée, la taille de la fenêtre de la session précédente sera restaurée lorsque vous ouvrez une fenêtre FSearch. Notez que certains gestionnaires de fenêtres ignorent cette demande et forcent la fenêtre à avoir une taille différente.
nb_no: <b>Husk vindustørrelse:</b> Hvis skrudd på, vil vindustørrelsen gjenopprettes fra forrige sesjon når du åpner FSearch. Merk at noen vindusbehandlere ignorerer denne forespørselen fra programmer og tvinger vinduet til en annen størrelse.

source: <b>Behaviour after successfully opening a file:</b> When a file/folder was successfully opened one of the following actions can be performed: • <b>Nothing:</b> Nothing happens. • <b>Minimize:</b> The currently selected FSearch window becomes minimized. • <b>Close:</b> Quit FSearch. You can configure if those actions should be triggered when the file was opened with • <b>keyboard shortcuts or menu entries</b> and/or • <b>mouse click</b>
fr: <b>Comportement après l'ouverture réussie d'un fichier :</b> Lorsqu'un fichier/dossier a été ouvert avec succès, l'une des actions suivantes peut être effectuée : • <b>Rien :</b> Rien ne se passe. • <b>Réduire :</b> La fenêtre FSearch est réduite. • <b>Fermer :</b> Quitter FSearch. Vous pouvez configurer si ces actions doivent être déclenchées lorsque le fichier a été ouvert avec • <b>un raccourci clavier ou les entrées de menu</b> et/ou • <b>un clic de souris</b>
nb_no: <b>Adferd når en fil åpnes:</b> Når en fil/mappe åpnes kan en av følgende handlinger utføres: • <b>Ingenting:</b> Ingenting skjer. • <b>Minimer:</b> Det valgte FSearch-vinduet minimeres. • <b>Lukk:</b> Lukk FSearch. Du kan konfigurere om disse handlingene burde utløses når filen åpnes med • <b>tastatursnarveier eller menyvalg</b> og/eller • <b>museklikk</b>
