Repository: cboxdoerfer/fsearch
Catalog: po/*.po
Languages: fr, nb_no

source: Deleted %d file(s).
fr: %d fichier(s) supprimé(s).
nb_no: Slettet %d fil(er).

source: Moved %d file(s) to the trash.
fr: %d fichier(s) déplacé(s) dans la corbeille.
nb_no: Flyttet %d fil(er) til papirkurven.

source: The database needs to be updated before it becomes aware of those changes! This will be fixed with future updates.
fr: La base de données doit être mise à jour avant de prendre connaissance de ces changements ! Ceci sera réparé dans de futures mises à jour.
nb_no: Databasen må oppdateres før den ser endringene! Dette skal fikses i fremtidige oppdateringer.

source: Do you really want to open %d file property windows?
fr: Voulez-vous vraiment ouvrir %d fenêtre(s) de propriétés ?
nb_no: Ønsker du virkelig å åpne %d filegenskapsvinduer?

source: Opening file properties…
fr: Ouverture des propriétés du fichier…
nb_no: Åpner filegenskaper…

source: _File
fr: _Fichier
nb_no: _Fil

source: New Window
fr: Nouvelle fenêtre
nb_no: Nytt vindu

source: _Open
fr: _Ouvrir
nb_no: _Åpne

source: Open Folder
fr: Ouvrir le dossier
nb_no: Åpne mappe

source: Update Database
fr: Mettre à jour la base de données
nb_no: Oppdater database

source: Cancel Update
fr: Annuler la mise à jour
nb_no: Avbryt oppdatering

source: Close Window
fr: Fermer la fenêtre
nb_no: Lukk vindu

source: _Edit
fr: _Modifier
nb_no: _Rediger

source: _Copy
fr: _Copier
nb_no: _Kopier

source: Cu_t
fr: Cou_per
nb_no: Kli_pp

source: Select All
fr: Tout sélectionner
nb_no: Velg alt

source: Deselect All
fr: Tout désélectionner
nb_no: Fravelg alt

source: Invert Selection
fr: Inverser la sélection
nb_no: Inverter utvalg

source: _View
fr: _Affichage
nb_no: _Vis

source: _Search
fr: _Rechercher
nb_no: _Søk

source: _Help
fr: _Aide
nb_no: _Hjelp

source: Open _With
fr: Ouvrir _avec
nb_no: Åpne _med

source: _Open Folder
fr: _Ouvrir le dossier
nb_no: _Åpne mappe

source: Copy as Text
fr: Copier texte
nb_no: Kopier som tekst

source: Path + Name
fr: Chemin d'accès + Nom
nb_no: Sti + navn

source: Move to _Trash
fr: Déplacer dans la _corbeille
nb_no: Flytt til _papirkurv

source: video
fr: vidéo

source: Filter:
fr: Filtre :

source: Database
fr: Base de données

source: FSearch Online
fr: FSearch en ligne
